taurusolson.org
#+TITLE: Taurus Olson's Emacs configuration file
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-light.min.css" />
#+DATE: 2016-09-24

* Sensible defaults

  Use [[https://github.com/hrs/sensible-defaults.el][sensible-defaults.el]] for some basic settings.

#+BEGIN_SRC emacs-lisp
  (load-file "~/.emacs.d/resources/sensible-defaults.el")
  (sensible-defaults/use-all-settings)
  (sensible-defaults/use-all-keybindings)
#+END_SRC

* Personal information

#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Taurus Olson"
        user-mail-address "taurusolson@gmail.com")
#+END_SRC

* Global behavior
  Don't ask for confirmation when exiting Emacs.

#+BEGIN_SRC emacs-lisp
  (setq confirm-kill-emacs nil)
#+END_SRC

** =exec-path-from-shell=                                           :PACKAGE:

  Use the $PATH in Emacs.

#+BEGIN_SRC emacs-lisp
  (use-package exec-path-from-shell
    :config (exec-path-from-shell-initialize))
#+END_SRC

* Useful functions

#+BEGIN_SRC emacs-lisp
  (def-find-file emacs-config-file)

  (defun taurus/load-appropriate-theme (light-theme dark-theme)
    "Load the light theme in the morning and the dark theme at night"
    (interactive)
    (if (< (string-to-int (format-time-string "%H")) 19)
        (load-theme light-theme :no-confirm)
      (load-theme dark-theme :no-confirm)))

  (defun taurus/update-current-date ()
    "Updates the current date in an org file"
    (interactive)
    (save-excursion
      (goto-char (point-min))
      (search-forward "#+DATE:" nil t)
      (kill-line)
      (insert (format " %s" (format-time-string "%Y-%m-%d")))))
#+END_SRC

* Evil
** Global config

#+BEGIN_SRC emacs-lisp
  (use-package evil
   :config (evil-mode 1)

   :bind (:map evil-normal-state-map
               ;; Window movements
               ("C-k" . evil-window-up)
               ("C-j" . evil-window-down)
               ("C-l" . evil-window-right)
               ("C-h" . evil-window-left)
               ;; Emacs style
               ("C-a" . evil-beginning-of-line)
               ("C-e" . evil-end-of-line)
               ;; Save
               ("C-SPC" . save-buffer)
               ;; Describe functions
               ("? k" . describe-key)
               ("? v" . describe-variable)
               ("? f" . describe-function)
               ("? m" . describe-mode)
               ("? p" . describe-package)
          :map evil-insert-state-map
               ("C-a" . beginning-of-line)
               ("C-e" . end-of-line)))
#+END_SRC


** =evil-escape=

#+BEGIN_SRC emacs-lisp
(use-package evil-escape
    :diminish
    (evil-escape-mode)
    :config
    (evil-escape-mode)
    (setq-default evil-escape-key-sequence "kj"
                  evil-escape-delay 0.2)
    (setq evil-escape-unordered-key-sequence t))
#+END_SRC

** =evil-surround=                                                  :PACKAGE:

#+BEGIN_SRC emacs-lisp
  (use-package evil-surround
    :config
    (global-evil-surround-mode 1)
  )
#+END_SRC

** =evil-search-highlight-persist=                                  :PACKAGE:

#+BEGIN_SRC emacs-lisp
  (use-package evil-search-highlight-persist
    :config
    (global-evil-search-highlight-persist t)
  )
#+END_SRC

** =evil-leader=                                                    :PACKAGE:

#+BEGIN_SRC emacs-lisp
  (use-package evil-leader
    :init
    (global-evil-leader-mode)
    :config
    (evil-leader/set-leader ",")
    (evil-leader/set-key "e" 'find-emacs-config-file)
    (evil-leader/set-key "b" 'ibuffer)
    (evil-leader/set-key "d" 'dired-jump))
#+END_SRC

** =which-key=

#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :init (which-key-mode 1))
#+END_SRC

* Settings for Mac OS X

On Mac OS X, we set the =cmd= key (mac-command-modifier) to =meta= and =alt=
(mac-option-modifier) to nil.

#+BEGIN_SRC emacs-lisp
  (setq ns-command-modifier 'meta
        select-enable-clipboard t)

  (setq mac-option-modifier nil
        mac-command-modifier 'meta)

  ;avoid hiding with M-h
  (setq mac-pass-command-to-system nil)
#+END_SRC

* Org
** Agenda view
   The agenda shows the tasks for the current week and the next one.
   I set the schedule and deadline date of a task but I don't want to see 2 times this
   information in my agenda if the schedule date is the same as the deadline date.
   (see =org-agenda-skip-deadline-prewarning-if-scheduled= and
   =org-agenda-skip-scheduled-if-deadline-is-shown=)
   Moreover the todo list, doesn't show the tasks that are not schedule and have
   no deadline date.
   This allows me to set these dates in function of my agenda.
   I use the view grouping both the agenda and the todo list (=C-a n=)

#+BEGIN_SRC emacs-lisp
  (setq org-agenda-skip-deadline-prewarning-if-scheduled t
       org-agenda-skip-scheduled-if-deadline-is-shown t
       org-agenda-todo-ignore-deadlines t
       org-agenda-todo-ignore-scheduled t
       org-agenda-window-setup 'current-window
       org-deadline-warning-days 7
       org-agenda-show-log t
       org-agenda-span 'fortnight)
#+END_SRC

** Custom agenda views

   - d: Tasks for today

#+BEGIN_SRC emacs-lisp
  (setq org-agenda-custom-commands
        '(("d" "Daily Action List"
           ((agenda "" ((org-agenda-ndays 1)
                        (org-agenda-sorting-strategy '((agenda time-up priority-down tag-up)))
                        (org-deadline-warning-days 0)))))))
#+END_SRC

** My org usage

   Show the tasks for today when opening Emacs

#+BEGIN_SRC emacs-lisp
  (add-hook 'after-init-hook (lambda () (org-agenda nil "d")))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ;; Personal configuration
  (defconst org-directory "~/Dropbox/olson")
  (defconst olson-dir "~/Dropbox/olson")
  (defconst olson-index-file (expand-file-name "index.org" olson-dir))
  (defconst olson-diary-file (expand-file-name "diary.org" olson-dir))
  (defconst org-agenda-files (list olson-index-file))
  (setq org-archive-location "archives/%s_archive::")

  ;; Settings
  (setq org-todo-keywords
        '((sequence "TODO(t)" "ACTIVE(a)" "SOMEDAY(s)" "DEFERRED(f)" "|" "CANCELLED(x)" "DONE(d)")))

  ;; Define the find-file functions for index and diary
  (def-find-file olson-index-file)
  (def-find-file olson-diary-file)
#+END_SRC

   Don't ask before evaluating code blocks.
   Edit the code block in the same window.

#+BEGIN_SRC emacs-lisp
  (setq org-confirm-babel-evaluate nil
        org-src-window-setup 'current-window)
#+END_SRC

** =org-capture= to quickly add new tasks.

#+BEGIN_SRC emacs-lisp
    (setq org-capture-templates
        '(("t" "add new task in index" entry (file+headline olson-index-file "Tasks") "* TODO  %?\n")
          ("d" "add new day in diary" entry (file+headline olson-diary-file "Diary") "* %t %?\n")
  ))
#+END_SRC

** Babel
#+BEGIN_SRC emacs-lisp
  (require 'ob-clojure)
  ;; (org-babel-do-load-languages
  ;;  'org-babel-load-languages
  ;;  '((python . t)
  ;;    (R . t)))
#+END_SRC

** =org-bullets= for fancier bullets.

#+BEGIN_SRC emacs-lisp
  (use-package org-bullets
      :init
      (setq org-bullets-bullet-list
        '("◉" "◎" "○" "○" "○" "○"))
      :config
      (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
      (setq org-hide-leading-stars t))
#+END_SRC

** Log the closed tasks and create logs in the =:LOGBOOK:= drawer with =C-c C-z=.

#+BEGIN_SRC emacs-lisp
  (setq org-log-done t
        org-log-into-drawer t)
#+END_SRC

** Export to Markdown.

#+BEGIN_SRC emacs-lisp
  (eval-after-load "org"
    '(require 'ox-md nil t))
#+END_SRC

** Use syntax highlighting and indentation in source blocks while editing.

   When editing a code snippet, use the current window rather than popping open a
   new one (which shows the same information).

#+BEGIN_SRC emacs-lisp
  (setq org-src-fontify-natively t)
  (setq org-src-tab-acts-natively t)
#+END_SRC

** Keybindings

#+BEGIN_SRC emacs-lisp
  (define-key global-map "\C-co" 'org-capture)
  (global-set-key (kbd "C-c C-d") 'org-deadline)
  (define-key mode-specific-map [?a] 'org-agenda)
  (define-key global-map "\C-cl" 'org-store-link)
  (define-key global-map "\C-cL" 'org-insert-link-global)
  ;; (global-set-key (kbd "S-<return>") 'eval-last-sexp)
#+END_SRC

* Deft

#+BEGIN_SRC emacs-lisp
  (use-package deft
    :config
    (setq deft-extension "org"
          deft-default-extension "org"
          deft-directory "~/Dropbox/olson/notes"
          deft-auto-save-interval 0
          deft-text-mode 'org-mode))
#+END_SRC

** Use filename as title

#+BEGIN_SRC emacs-lisp
  (setq deft-use-filename-as-title nil)
  (setq deft-use-filter-string-for-filename t)
  (setq deft-file-naming-rules '((noslash . "_")
                                 (nospace . "_")
                                 (case-fn . downcase)))
  (setq deft-org-mode-title-prefix t)

  ;;advise deft to save window config
  (defun bjm-deft-save-windows (orig-fun &rest args)
    (setq bjm-pre-deft-window-config (current-window-configuration))
    (apply orig-fun args)
    )

  (advice-add 'deft :around #'bjm-deft-save-windows)

  ;function to quit a deft edit cleanly back to pre deft window
  (defun bjm-quit-deft ()
    "Save buffer, kill buffer, kill deft buffer, and restore window config to the way it was before deft was invoked"
    (interactive)
    (save-buffer)
    (kill-this-buffer)
    (switch-to-buffer "*Deft*")
    (kill-this-buffer)
    (when (window-configuration-p bjm-pre-deft-window-config)
      (set-window-configuration bjm-pre-deft-window-config)
      )
    )
#+END_SRC

** =deft= keybindings

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c q") 'bjm-quit-deft)
  (global-set-key (kbd "C-x n") 'deft)
  (global-set-key (kbd "C-x N") 'deft-new-file-named)
  (global-set-key (kbd "C-x C-g") 'deft-find-file)
#+END_SRC

