taurusolson.el

(load-file "~/.emacs.d/resources/sensible-defaults.el")
(sensible-defaults/use-all-settings)
(sensible-defaults/use-all-keybindings)

(setq user-full-name "Taurus Olson"
      user-mail-address "taurusolson@gmail.com")

(setq confirm-kill-emacs nil)

(use-package exec-path-from-shell
  :config (exec-path-from-shell-initialize))

(def-find-file emacs-config-file)

(defun taurus/load-appropriate-theme (light-theme dark-theme)
  "Load the light theme in the morning and the dark theme at night"
  (interactive)
  (if (< (string-to-int (format-time-string "%H")) 19)
      (load-theme light-theme :no-confirm)
    (load-theme dark-theme :no-confirm)))

(defun taurus/update-current-date ()
  "Updates the current date in an org file"
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (search-forward "#+DATE:" nil t)
    (kill-line)
    (insert (format " %s" (format-time-string "%Y-%m-%d")))))

(use-package evil
 :init
 (setq-default evil-escape-key-sequence "kj" evil-escape-delay 0.2)
 :config (evil-mode 1)

 :bind (:map evil-normal-state-map
             ;; Window movements
             ("C-k" . evil-window-up)
             ("C-j" . evil-window-down)
             ("C-l" . evil-window-right)
             ("C-h" . evil-window-left)
             ;; Emacs style
             ("C-a" . evil-beginning-of-line)
             ("C-e" . evil-end-of-line)
             ;; Save
             ("C-SPC" . save-buffer)
             ;; Describe functions
             ("? k" . describe-key)
             ("? v" . describe-variable)
             ("? f" . describe-function)
             ("? m" . describe-mode)
             ("? p" . describe-package)
        :map evil-insert-state-map
             ("C-a" . beginning-of-line)
             ("C-e" . end-of-line)))

(use-package evil-surround
  :config
  (global-evil-surround-mode 1)
)

(use-package evil-search-highlight-persist
  :config
  (global-evil-search-highlight-persist t)
)

(use-package evil-leader
  :init
  (global-evil-leader-mode)
  :config
  (evil-leader/set-leader ",")
  (evil-leader/set-key "e" 'find-emacs-config-file)
  (evil-leader/set-key "b" 'ibuffer)
  (evil-leader/set-key "d" 'dired-jump))

(use-package which-key
  :init (which-key-mode 1))

(setq ns-command-modifier 'meta
      select-enable-clipboard t)

(setq mac-option-modifier nil
      mac-command-modifier 'meta)

;avoid hiding with M-h
(setq mac-pass-command-to-system nil)

(setq org-agenda-skip-deadline-prewarning-if-scheduled t
     org-agenda-skip-scheduled-if-deadline-is-shown t
     org-agenda-todo-ignore-deadlines t
     org-agenda-todo-ignore-scheduled t
     org-agenda-window-setup 'current-window
     org-deadline-warning-days 7
     org-agenda-show-log t
     org-agenda-span 'fortnight)

(setq org-agenda-custom-commands
      '(("d" "Daily Action List"
         ((agenda "" ((org-agenda-ndays 1)
                      (org-agenda-sorting-strategy '((agenda time-up priority-down tag-up)))
                      (org-deadline-warning-days 0)))))))

(add-hook 'after-init-hook (lambda () (org-agenda nil "d")))

;; Personal configuration
(defconst org-directory "~/Dropbox/olson")
(defconst olson-dir "~/Dropbox/olson")
(defconst olson-index-file (expand-file-name "index.org" olson-dir))
(defconst olson-diary-file (expand-file-name "diary.org" olson-dir))
(defconst org-agenda-files (list olson-index-file))
(setq org-archive-location "archives/%s_archive::")

;; Settings
(setq org-todo-keywords
      '((sequence "TODO(t)" "ACTIVE(a)" "SOMEDAY(s)" "DEFERRED(f)" "|" "CANCELLED(x)" "DONE(d)")))

;; Define the find-file functions for index and diary
(def-find-file olson-index-file)
(def-find-file olson-diary-file)

(setq org-confirm-babel-evaluate nil
      org-src-window-setup 'current-window)

(setq org-capture-templates
      '(("t" "add new task in index" entry (file+headline olson-index-file "Tasks") "* TODO  %?\n")
        ("d" "add new day in diary" entry (file+headline olson-diary-file "Diary") "* %t %?\n")
))

(require 'ob-clojure)
;; (org-babel-do-load-languages
;;  'org-babel-load-languages
;;  '((python . t)
;;    (R . t)))

(use-package org-bullets
    :init
    (setq org-bullets-bullet-list
      '("◉" "◎" "○" "○" "○" "○"))
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
    (setq org-hide-leading-stars t))

(setq org-log-done t
      org-log-into-drawer t)

(eval-after-load "org"
  '(require 'ox-md nil t))

(setq org-src-fontify-natively t)
(setq org-src-tab-acts-natively t)

(define-key global-map "\C-co" 'org-capture)
(global-set-key (kbd "C-c C-d") 'org-deadline)
(define-key mode-specific-map [?a] 'org-agenda)
(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map "\C-cL" 'org-insert-link-global)
;; (global-set-key (kbd "S-<return>") 'eval-last-sexp)

(use-package deft
  :config
  (setq deft-extension "org"
        deft-default-extension "org"
        deft-directory "~/Dropbox/olson/notes"
        deft-auto-save-interval 0
        deft-text-mode 'org-mode))

(setq deft-use-filename-as-title nil)
(setq deft-use-filter-string-for-filename t)
(setq deft-file-naming-rules '((noslash . "_")
                               (nospace . "_")
                               (case-fn . downcase)))
(setq deft-org-mode-title-prefix t)

;;advise deft to save window config
(defun bjm-deft-save-windows (orig-fun &rest args)
  (setq bjm-pre-deft-window-config (current-window-configuration))
  (apply orig-fun args)
  )

(advice-add 'deft :around #'bjm-deft-save-windows)

;function to quit a deft edit cleanly back to pre deft window
(defun bjm-quit-deft ()
  "Save buffer, kill buffer, kill deft buffer, and restore window config to the way it was before deft was invoked"
  (interactive)
  (save-buffer)
  (kill-this-buffer)
  (switch-to-buffer "*Deft*")
  (kill-this-buffer)
  (when (window-configuration-p bjm-pre-deft-window-config)
    (set-window-configuration bjm-pre-deft-window-config)
    )
  )

(global-set-key (kbd "C-c q") 'bjm-quit-deft)
(global-set-key (kbd "C-x n") 'deft)
(global-set-key (kbd "C-x N") 'deft-new-file-named)
(global-set-key (kbd "C-x C-g") 'deft-find-file)
