taurusolson.el

(use-package magit
  :init (use-package evil :config (evil-mode 1))
  :config
  (define-key evil-normal-state-map (kbd "gs") 'magit-status)
  (define-key evil-normal-state-map (kbd "gv") 'magit-log-all)
  )

(setq-default indent-tabs-mode nil)

(use-package company
  :init (add-hook 'after-init-hook 'global-company-mode)
  :config (company-mode)
  )

(use-package markdown-mode
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "multimarkdown"))

(defun paredit-kill-then-insert ()
  (interactive)
  (paredit-kill)
  (evil-insert 1))

(use-package paredit
 :init (use-package evil :config (evil-mode 1))
 :diminish paredit-mode
 :config
 (paredit-mode)
 (define-key evil-normal-state-map (kbd "D") 'paredit-kill)
 (define-key evil-normal-state-map (kbd "C") 'paredit-kill-then-insert)
)

(use-package undo-tree
  :diminish undo-tree-mode)

(use-package eldoc
  :diminish eldoc-mode)

(use-package ess
  :commands R
  :config
  (progn
    (setq inferior-R-program-name "/usr/bin/R")
    (add-to-list 'auto-mode-alist '("\\.R$" . R-mode))
    (setq comint-input-ring-size 1000)
    ;; Eldoc
    (setq ess-use-eldoc 'script-only)
    (setq ess-eldoc-show-on-symbol t)
    (setq ess-eldoc-abbreviation-style t)
    ;; Indentation
    (setq ess-indent-level 4)
    (setq ess-arg-function-offset 4)
    (setq ess-else-offset 4)
    ;; R repl
    (add-hook 'inferior-ess-mode-hook
           '(lambda nil
              (define-key inferior-ess-mode-map [up]
                'comint-previous-matching-input-from-input)
              (define-key inferior-ess-mode-map [down]
                'comint-next-matching-input-from-input)
              (define-key inferior-ess-mode-map [\C-x \t]
                'comint-dynamic-complete-filename)))))

(use-package virtualenvwrapper
  :init (setq venv-location "~/.virtualenvs")
)

;;(use-package clojure-mode)
;;(use-package cider
;;  :init (use-package evil-leader :config (global-evil-leader-mode))
;;  :config
;;  (add-hook clojure-mode-hook
;;            (lambda () (evil-leader/set-key "x" 'cider-eval-last-sexp))))

(when window-system
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (tooltip-mode -1))

(set-frame-parameter nil 'fullscreen 'fullboth)

(setq hrs/default-font "Fira Code")
(setq hrs/default-font-size 20)
(setq hrs/current-font-size hrs/default-font-size)
(setq hrs/font-change-increment 1.1)

(defun hrs/set-font-size ()
  "Set the font to `hrs/default-font' at `hrs/current-font-size'."
  (set-frame-font
   (concat hrs/default-font "-" (number-to-string hrs/current-font-size))))

(defun hrs/reset-font-size ()
  "Change font size back to `hrs/default-font-size'."
  (interactive)
  (setq hrs/current-font-size hrs/default-font-size)
  (hrs/set-font-size))

(defun hrs/increase-font-size ()
  "Increase current font size by a factor of `hrs/font-change-increment'."
  (interactive)
  (setq hrs/current-font-size
        (ceiling (* hrs/current-font-size hrs/font-change-increment)))
  (hrs/set-font-size))

(defun hrs/decrease-font-size ()
  "Decrease current font size by a factor of `hrs/font-change-increment', down to a minimum size of 1."
  (interactive)
  (setq hrs/current-font-size
        (max 1
             (floor (/ hrs/current-font-size hrs/font-change-increment))))
  (hrs/set-font-size))

(define-key global-map (kbd "C-)") 'hrs/reset-font-size)
(define-key global-map (kbd "C-+") 'hrs/increase-font-size)
(define-key global-map (kbd "C--") 'hrs/decrease-font-size)
(hrs/set-font-size)

(blink-cursor-mode 0)
(column-number-mode 1)

(use-package rainbow-delimiters
  :ensure t
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
  )

(use-package linum-relative
  :config
  (linum-relative-mode 1))

(use-package golden-ratio
  :disabled t
  :diminish golden-ratio-mode
  :init
  (golden-ratio-mode t)
  :config
  (add-to-list 'golden-ratio-extra-commands 'switch-window)
  (add-to-list 'golden-ratio-extra-commands 'evil-window-up)
  (add-to-list 'golden-ratio-extra-commands 'evil-window-down)
  (add-to-list 'golden-ratio-extra-commands 'evil-window-right)
  (add-to-list 'golden-ratio-extra-commands 'evil-window-left)
  (setq golden-ratio-exclude-modes '("magit-auto-revert-mode"
                                     "eshell-mode" "dired-mode")))

(use-package smooth-scrolling
 :init (setq smooth-scroll-margin 2)
 :config (smooth-scrolling-mode 1)
)

(use-package ivy
  :diminish (ivy-mode . "")
  :bind
  (:map ivy-mode-map ("M-b" . ivy-switch-buffer))
  :config
  (ivy-mode 1)
  ;; configure regexp engine.
  (setq ivy-re-builders-alist
        '((t . ivy--regex-fuzzy)))
    ;; number of result lines to display
    (setq ivy-height 10)
    ;; does not count candidates
    (setq ivy-count-format "")
    ;; no regexp by default
    (setq ivy-initial-inputs-alist nil))

(use-package counsel
  :bind
  (:map counsel-mode-map ("M-r" . counsel-find-file))
  :config
  (counsel-mode 1))

(use-package swiper)

;; (setq ido-enable-flex-matching t)
;; (setq ido-everywhere t)
;; (ido-mode 1)
;; (setq ido-create-new-buffer 'always)

;; (global-set-key (kbd "M-b") 'ido-switch-buffer)
;; (global-set-key (kbd "M-f") 'ido-find-file)

(use-package ido-ubiquitous
  :disabled t
  :config (ido-ubiquitous)
)

(use-package ido-vertical-mode
  :disabled t
  :init (setq ido-vertical-define-keys 'C-n-and-C-p-only)
  :config (ido-vertical-mode 1)
)

(use-package flx-ido
  :disabled t
  :config (flx-ido-mode 1))

(use-package smex
  :disabled t
  :config (smex-initialize)
  :bind (("M-x" . smex)))

(global-set-key (kbd "C-x C-b") 'ibuffer)

(use-package elisp-slime-nav
    :diminish elisp-slime-nav-mode
    :init (use-package evil-leader :config (global-evil-leader-mode))
    :config
    (evil-leader/set-key "t" 'elisp-slime-nav-find-elisp-thing-at-point)
    (evil-leader/set-key "h" 'elisp-slime-nav-describe-elisp-thing-at-point)
)
