taurusolson.org
** Lisps

   Make these modes
   get called every time emacs-lisp-mode is enabled:
   - =turn-on-eldoc-mode=
   - =paredit-mode=
   - =rainbow-delimiters=
   - =elisp-slime-nav-mode=

#+BEGIN_SRC emacs-lisp
  (defun configure-lispy-mode-hooks ()
      ;; (setq show-paren-style 'expression)
      (turn-on-eldoc-mode)
      (paredit-mode)
      (rainbow-delimiters-mode)
      (elisp-slime-nav-mode))

  (setq lispy-mode-hooks
      '(clojure-mode-hook
        emacs-lisp-mode-hook
        lisp-mode-hook
        scheme-mode-hook))

  (dolist (hook lispy-mode-hooks)
      (add-hook hook 'configure-lispy-mode-hooks))

  (evil-define-key 'normal emacs-lisp-mode-map (kbd "K") 'elisp-slime-nav-describe-elisp-thing-at-point)
#+END_SRC

* Keybindings

  I use =general.el= to manage my keybindings. It works perfectly with
  =which-key= and =evil=.

#+BEGIN_SRC emacs-lisp
  (use-package general :ensure t
    :config
    (general-define-key
     :states '(normal visual insert emacs)
     :prefix "SPC"
     :non-normal-prefix "C-SPC"

      ;; counsel
      "c" '(:ignore t :which-key "Counsel")
      "ca"   'counsel-ag

      ;; olson
      "o" '(:ignore t :which-key "Olson")
      "oi" 'find-olson-index-file
      "od" 'find-olson-diary-file

      ;; deft
      "d" '(:ignore t :which-key "Deft")
      "dq" 'bjm-quit-deft
      "do" 'deft
      "dn" 'deft-new-file-named
      "df" 'deft-find-file
  ))
#+END_SRC


** =key-seq=

#+BEGIN_SRC emacs-lisp
(use-package key-chord :ensure t
  :defer 1 ; do not load right at startup
  :config
  (setq key-chord-two-keys-delay 0.2)
  ;; need to use key-seq. otherwise key order does not matter. that's bad.
  ;; i want latency only on x.
  (use-package key-seq :ensure t
    :config
    (key-seq-define evil-insert-state-map "qf" #'ivy-switch-buffer)
    (key-seq-define evil-insert-state-map "qv" #'git-gutter:stage-hunk)
    (key-seq-define evil-insert-state-map "qc" #'avy-goto-word-1)
    (key-seq-define evil-insert-state-map "ql" #'avy-goto-line)
    (key-seq-define evil-insert-state-map "qs" #'save-buffer)
    (key-seq-define evil-insert-state-map "qp" #'hydra-projectile/body)
    (key-seq-define evil-insert-state-map "QV" #'magit-status)))
#+END_SRC

* Themes
** zenburn-theme                                                    :PACKAGE:

#+BEGIN_SRC emacs-lisp
  (use-package zenburn-theme
   :disabled t
   :init (load-theme 'zenburn t))
#+END_SRC

** solarized-theme                                                  :PACKAGE:

#+BEGIN_SRC emacs-lisp
  (use-package solarized-theme
    :init
    (setq solarized-use-variable-pitch nil)
    (setq solarized-height-plus-1 1.0)
    (setq solarized-height-plus-2 1.0)
    (setq solarized-height-plus-3 1.0)
    (setq solarized-height-plus-4 1.0)
    (setq solarized-high-contrast-mode-line t)
    :config
    (taurus/load-appropriate-theme 'solarized-light 'solarized-dark))
#+END_SRC

** tomorrow                                                         :PACKAGE:

#+BEGIN_SRC emacs-lisp
  (use-package color-theme-sanityinc-tomorrow
    :disabled t
    :config
    (taurus/load-appropriate-theme 'sanityinc-tomorrow-day
                                   sanityinc-tomorrow-night))
#+END_SRC

** doom-theme

#+BEGIN_SRC emacs-lisp
  (use-package doom-themes
    :disabled t
    :init
    ;; brighter source buffers
    (add-hook 'find-file-hook 'doom-buffer-mode)
    ;; brighter minibuffer when active
    (add-hook 'minibuffer-setup-hook 'doom-brighten-minibuffer)
    :config
    (load-theme 'doom-one t))
#+END_SRC

** sexy-monochrome

#+BEGIN_SRC emacs-lisp
  (use-package sexy-monochrome-theme
    :disabled t
    :config (load-theme 'sexy-monochrome t))
#+END_SRC
